### IMDB Movies- Part 3
Laura Dimaria
8/4/22

In [1]:
#Imports
import pandas as pd
import numpy as np

import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

In [2]:
#MySql connection
connection = "mysql+pymysql://root:Daddy6669!@localhost/movies"
engine = create_engine(connection)

if database_exists(connection) == False:
    create_database(connection)
else :
    print('The database already exists')

The database already exists

In [3]:
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller"

In [4]:
#drop unnecessary columns
basics = basics.drop(columns=['originalTitle','isAdult','titleType', 'endYear'])

In [5]:
#genre split column
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,Grizzly II: Revenge,2020,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"
...,...,...,...,...,...,...
81952,tt9914942,Life Without Sara Amat,2019,74,Drama,[Drama]
81953,tt9915872,The Last White Witch,2019,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81954,tt9916170,The Rehearsal,2019,51,Drama,[Drama]
81955,tt9916190,Safeguard,2020,90,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81956,tt9916362,Coven,2020,92,"Drama,History","[Drama, History]"

In [6]:
#Use .explode on genres 
exploded_genres = basics.explode('genres_split')
exploded_genres.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018,122,Drama,Drama

In [7]:
#get unique genre names
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [8]:
title_genres = exploded_genres[['tconst', 'genres_split']]
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [9]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [10]:
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres.head(3)

/var/folders/pv/svznfxqn6kgd8yj6q0g_jnsr0000gn/T/ipykernel_3733/4272001934.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18

In [12]:
#create genres df
genres = pd.DataFrame({'genre_name': genre_map.keys(),
                         'genre_id':genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [13]:
basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,Grizzly II: Revenge,2020,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"

In [15]:
#drop genre columns
basics = basics.drop(columns=['genres_split', 'genres'])
basics.head(3)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122

### SQL

In [16]:
#create connection
connection = "mysql+pymysql://root:Daddy6669!@localhost/movies"
engine = create_engine(connection)
engine

if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [17]:
#max string lengths for object column
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

#create a schema dictonary
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()}

In [18]:
#save to sql
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

81957

In [19]:
#set primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [20]:
#repeat process for title genres
key_len = title_genres['tconst'].fillna('').map(len).max()

#title genres schema
df_schema = {
    "tconst": String(key_len+1), 
    'genre_id': Integer()}

#save to sql
title_genres.to_sql('title_genres', engine, dtype=df_schema, 
                   if_exists = 'replace', index=False)

153031

In [21]:
#genre name
name_len = genres['genre_name'].fillna('').map(len).max()

df_schema = {
    "genre_name": String(name_len+1), 
    'genre_id': Integer()}
#save to sql
genres.to_sql('genres', engine, dtype=df_schema,
                   if_exists = 'replace', index=False)

#add primary key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [22]:
#repeat process for ratings
ratings = pd.read_csv('Data/ratings.csv.gz', low_memory = False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1899
1  tt0000002            5.9       254
2  tt0000003            6.5      1692
3  tt0000004            5.7       166
4  tt0000005            6.2      2509

In [23]:
key_len = ratings['tconst'].fillna('').map(len).max()

df_schema = {
    "tconst": String(key_len+1), 
    'averageRating': Float(),
    'numVotes': Integer()}

ratings.to_sql('ratings', engine, dtype=df_schema,
                      if_exists = 'replace', index=False)
engine.execute('ALTER TABLE ratings ADD PRIMARY KEY (`tconst`);')

In [24]:
#/Users/lauradimaria/Desktop/GitHub/CD--Project-3-IMDB-/Data/tmdb_results_combined.csv.gz

In [25]:
#load tmdb combined
tmdb_df = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb_df.head(3)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,...,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.400,42.0,R
1,tt0120630,0.0,/sPAwM8WxMdXNlqeP4F9DMe9LYoY.jpg,"{'id': 718551, 'name': 'Chicken Run Collection...",45000000.0,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",NaN,7443.0,en,Chicken Run,...,224834564.0,84.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,This ain't no chick flick. It's poultry in mot...,Chicken Run,0.0,6.723,4086.0,G
2,tt0120755,0.0,/24DZfupDlhXeTchmcOkoGRhP5Vg.jpg,"{'id': 87359, 'name': 'Mission: Impossible Col...",125000000.0,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, '...",NaN,955.0,en,Mission: Impossible II,...,546388105.0,123.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Expect the impossible again.,Mission: Impossible II,0.0,6.107,5395.0,PG-13

In [28]:
#You only need to keep the imdb_id, revenue, budget, and certification columns
tmdb_df = tmdb_df[['imdb_id','budget','revenue','certification']]
tmdb_df.head(3)

     imdb_id       budget      revenue certification
0  tt0120467     120000.0      14904.0             R
1  tt0120630   45000000.0  224834564.0             G
2  tt0120755  125000000.0  546388105.0         PG-13

In [30]:
#max length for new object column
tmdb_len = tmdb_df['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_df['certification'].fillna('').map(len).max()
#df_schema for genres table
df_schema = {
    'imdb_id':String(tmdb_len+1),
    'budget':Float(),
    'revenue':Float(),
    'certification':Text(cert_len+1)}
#save to swl
tmdb_df.to_sql('tmdb_data', engine, dtype=df_schema, if_exists='replace', index=False)
#add primary key for imdb id
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

### SQL tables

In [32]:
#show tables
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres
4        tmdb_data

In [33]:
q = """
SELECT * 
FROM genres LIMIT 5
;"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [34]:
q = """
SELECT * 
FROM ratings LIMIT 5
;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1899
1  tt0000002            5.9       254
2  tt0000003            6.5      1692
3  tt0000004            5.7       166
4  tt0000005            6.2      2509

In [35]:
q = """
SELECT * 
FROM title_basics LIMIT 5
;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0093119,Grizzly II: Revenge,2020.0,74

In [36]:
q = """
SELECT * 
FROM title_genres LIMIT 5
;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [37]:
q = """
SELECT * 
FROM tmdb_data LIMIT 5
;"""
pd.read_sql(q, engine)

     imdb_id      budget      revenue certification
0  tt0118589  22000000.0    5271670.0         PG-13
1  tt0120467    120000.0      14904.0             R
2  tt0120630  45000000.0  224835000.0             G
3  tt0120681  35000000.0   74558100.0             R
4  tt0120737  93000000.0  871368000.0         PG-13